package utils;

public class P {
    private String ads="";
    private StringBuffer sb=new StringBuffer();
    /**
     ****************************************************************************************
     * */
    /**
     *g得到s链式连接的字符串
     * */
    public String gad() {
        return ads;
    }

    /**
     * 先用gp得到一个新类,注意,一定要用gp得到new类,才能调用该方法
     *拼接字符串封装
     * 调用该方法链式增加字符串
     * 然后调用gad()得到结果
     * */
    public P sad(String str) {
        ads=sb.append(str).toString();
        return this;
    }

    /**
     ****************************************************************************************
     * */
    /**
     *生成新类new封装
     * */

      public static P gp(){
          return new P();
      }


    /**
     *打印封装
     * */
        public static void p(Object o){
            System.out.println(o);
        }


    /**
     ****************************************************************************************
     * */

    /**
     ****************************************************************************************
     * */

    public static void main(String[]args){
        String addStr = P.gp().sad("年后").sad("你好！").sad("失落的房间").gad();
        P.p(addStr);
    }
    /**
     ****************************************************************************************
     * */
}
/**
 ****************************************************************************************
 * */